src/СРМ/src/Enums/ФорматыТекстаКомментариев/ФорматыТекстаКомментариев.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФорматыТекстаКомментариев</name>
  <enumValues>
    <name>HTML</name>
  </enumValues>
  <enumValues>
    <name>Markdown</name>
  </enumValues>
</mdclass:Enum>

src/СРМ/src/CommonModules/РедакторКомментария/Module.bsl
#Область ПрограммныйИнтерфейс

#Область СобытияФормы
Процедура ПриСозданииНаСервере(Форма, ГруппаЭлементовТекста, ПутьКДанным, ФорматТекста = Неопределено) Экспорт
	ФорматТекстаРедактирования=ФорматТекстаРедактирования(ФорматТекста);

	Если ФорматТекстаРедактирования = Перечисления.ФорматыТекстаКомментариев.Markdown Тогда
		РМ_MarkdownСервер.ВставитьПолеРедактированияТекстаНаФорму(Форма, ГруппаЭлементовТекста, ПутьКДанным);
	Иначе
		РВ_РедакторWysiwygHTML.ВставитьПолеРедактированияТекстаНаФорму(Форма, ГруппаЭлементовТекста, ПутьКДанным);
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписьюНаСервере(Форма, ТекущийОбъект, ПутьКДанным, ФорматТекста = Неопределено) Экспорт

	ТекущийОбъект.ДополнительныеСвойства.Вставить("ДанныеПрисоединенныхФайлов",
		РедакторКомментарияКлиентСервер.ДанныеПрисоединенныхФайлов(Форма, ПутьКДанным, ФорматТекста));

КонецПроцедуры

Процедура ПриЗаписиНаСервере(Форма, ВладелецФайлов, ПутьКДанным, ФорматТекста = Неопределено, Предмет = Неопределено) Экспорт
	ФорматТекстаРедактирования=ФорматТекстаРедактирования(ФорматТекста);

	Если ФорматТекстаРедактирования = Перечисления.ФорматыТекстаКомментариев.Markdown Тогда
		РМ_MarkdownСервер.ЗаписатьНовыеПрисоединенныеФайлы(Форма, ВладелецФайлов, ПутьКДанным, Предмет);
	Иначе
		РВ_РедакторWysiwygHTML.ЗаписатьНовыеПрисоединенныеФайлы(Форма, ВладелецФайлов, ПутьКДанным, Предмет);
	КонецЕсли;

КонецПроцедуры

Процедура ПослеЗаписиНаСервере(Форма, ПутьКДанным, ФорматТекста = Неопределено) Экспорт
	ФорматТекстаРедактирования=ФорматТекстаРедактирования(ФорматТекста);

	Если ФорматТекстаРедактирования = Перечисления.ФорматыТекстаКомментариев.Markdown Тогда
		РМ_MarkdownСервер.УдалитьНовыеПрисоединенныеФайлыСФормыПослеЗаписи(Форма, ПутьКДанным);
	Иначе
		РВ_РедакторWysiwygHTML.УдалитьНовыеПрисоединенныеФайлыСФормыПослеЗаписи(Форма, ПутьКДанным);
	КонецЕсли;

КонецПроцедуры

Процедура ПрочитатьПрисоединенныеФайлы(Форма, ВладелецФайлов, ПутьКДанным, ФорматТекста = Неопределено) Экспорт
	ФорматТекстаРедактирования=ФорматТекстаРедактирования(ФорматТекста);

	Если ФорматТекстаРедактирования = Перечисления.ФорматыТекстаКомментариев.Markdown Тогда
		РМ_MarkdownСервер.ПрочитатьПрисоединенныеФайлы(Форма, ВладелецФайлов, ПутьКДанным);
	Иначе
		РВ_РедакторWysiwygHTML.ПрочитатьПрисоединенныеФайлы(Форма, ВладелецФайлов, ПутьКДанным);
	КонецЕсли;

КонецПроцедуры
#КонецОбласти

Функция ВидРедактораКомментарияПользователя(ИмяПользователя = Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	ВидПоУмолчанию=Константы.ВидРедактораКомментария.Получить();
	Если Не ЗначениеЗаполнено(ВидПоУмолчанию) Тогда
		ВидПоУмолчанию=Перечисления.ФорматыТекстаКомментариев.HTML;
	КонецЕсли;

	ВидРедактора = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиЗадач", "ВидРедактораКомментария",
		ВидПоУмолчанию, , ИмяПользователя);

	Возврат ВидРедактора;

КонецФункции

Процедура УстановитьВидРедактораКомментарияПользователя(ВидРедактора, ИмяПользователя = Неопределено) Экспорт
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("НастройкиЗадач", "ВидРедактораКомментария", ВидРедактора, ,
		ИмяПользователя, Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ФорматТекстаРедактирования(ФорматТекста = Неопределено) Экспорт
	Если ФорматТекста = Неопределено Тогда
		ФорматТекстаРедактирования=Константы.ВидРедактораКомментария.Получить();
	Иначе
		ФорматТекстаРедактирования=ФорматТекста;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ФорматТекстаРедактирования) Тогда
		ФорматТекстаРедактирования=ВидРедактораКомментарияПользователя();
	КонецЕсли;

	Возврат ФорматТекстаРедактирования;
КонецФункции

Функция ВариантыОформленияТекстаКомментария() Экспорт
	Варианты=Новый Структура;

	Для Каждого ТекЗначение Из Метаданные.Перечисления.ФорматыТекстаКомментариев.ЗначенияПеречисления Цикл
		Варианты.Вставить(ТекЗначение.Имя, Перечисления.ФорматыТекстаКомментариев[ТекЗначение.Имя]);
	КонецЦикла;

	Возврат Варианты;
КонецФункции

#КонецОбласти
